yiqing001/ESP32-C3/sdkconfig.defaults
# 新环境首次配置时默认目标芯片（与已提交的 sdkconfig 一致）
CONFIG_IDF_TARGET="esp32c3"

# OTA 双分区（须与 sdkconfig 一致；改 defaults 不会自动覆盖已有 sdkconfig）
# CONFIG_PARTITION_TABLE_SINGLE_APP is not set
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# HTTP OTA（局域网）
CONFIG_ESP_HTTP_SERVER=y
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# OTA 写 Flash 可能阻塞较久，放宽看门狗避免上传中途复位
CONFIG_ESP_INT_WDT_TIMEOUT_MS=1000
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# mDNS 设备发现
CONFIG_MDNS_MAX_SERVICES=4

# 请在 menuconfig -> Remote OTA (WiFi) 中填写 SSID/密码（勿将真实密码提交到公开仓库）
CONFIG_OTA_WIFI_SSID=""
CONFIG_OTA_WIFI_PASSWORD=""
CONFIG_OTA_DEVICE_NAME_PREFIX="MaiQing-C3"
CONFIG_OTA_HTTP_PORT=80
